Autodesk.Revit.DB.ImageTypeOptions.IsValid(Autodesk.Revit.DB.Document)
If true the ImageTypeOptions can be used to create or reload an ImageType.
Remarks:
This method returns true if all the following checks are true:
The Path points to a file that is a supported image file type. The Path points to a file that is not encrypted, which can happen for PDF files. The Path points to a file that contains the specified PageNumber. Only imported images are allowed in family documents.
document:
The document.
Returns:
Returns True if the options can be used to create or reload an ImageType.  False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceReference)
Update the external resource reference to an image.
resourceReference:
An external resource reference to an image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetPath(System.String,System.Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
path:
The file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetPath(System.String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location. ImageType will respectively use an absolute or relative path.
path:
The file path that specifies the image to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ImageTypeOptions.SourceType
Indicates whether the image type is a link or an import.
Remarks:
Use this property with the method ImageType::Create to create a linked image type.
Use this property with the method ImageType::ReloadFrom to convert an import image type to a link and vice versa.
Valid values are 'Import' and 'Link'.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The ImageType source is not correct. Only Link or Import values are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.ImageTypeOptions.Resolution
The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image.
Remarks:
For raster based image formats (*.bmp, *.jpg, *.jpeg, *.png, *.tif)
the Resolution is used to calculate the size of the image from the number
of pixels in the horizontal and vertical directions.
For PDF files, which have a known paper size, the Resolution is used
to control the amount of detail to capture in the image.
Increasing the Resolution of PDF based images will add more
detail to the image, but will also increase the amount of
data stored in the project file.
The default value of this property is 72 dpi.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for resolution must be positive.
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.PageNumber
The page in the file to be used for the image
Remarks:
The default value of this property is 1.  This default is appropriate for most file types.
This should be used for files, such as PDF files, that can have multiple pages.
Valid values range from 1 to the number of pages in the file.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for pageNumber is not positive.
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.Path
The path of the file that specifies the image to be used.
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
Remarks:
ImageTypeOptions uses an external resource reference to determine the local path that will be used
to open the image file. The operation to obtain the local path requires the resource to be loaded and is
performed at a later time when the local path is needed, for example, for validation. See also
LoadResource method of Autodesk.Revit.DB.IExternalResourceServer.
When the provided external resource reference contains a local file path, the information can include
an indication that the path should be treated as a relative path.
resourceReference:
An external resource reference to an image.
sourceType:
Specifies the image type source. Valid values are 'Import' and 'Link'.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ImageType source is not correct. Only Link or Import values are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(System.String,System.Boolean,Autodesk.Revit.DB.ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
This constructor saves an additional setting that indicates whether the imagetype
will be a link or an import.
path:
The file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
sourceType:
Specifies the image type source. Valid values are 'Import' and 'Link'.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ImageType source is not correct. Only Link or Import values are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.ImageTypeOptions
Represents the options used in ImageType::Create(Document, ImageTypeOptions)
and ImageType.ReloadFrom(ImageTypeOptions) methods.
Remarks:
ImageTypeOptions are used to describe how an ImageType should be created from
an image file.
ImageTypeOptions are used to specify the location of the image file to use for the image
using either a string path or an Autodesk.Revit.DB.ExternalResourceReference.
ImageTypeOptions are used to specify if the file path should be stored as an absolute path,
or a relative path.  A relative path is relative to the location of the project file,
unless the file is workshared, in which case the relative path is relative to the location of the central file.
Note that the relative path option is only available if the project file has been saved.
ImageTypeOptions are used to specify whether the image should be imported or linked.
For imported images the image data is added to the Revit project file.
For linked images the image data is reloaded everytime the project file is opened.
Linked images are only available if they were reloaded successfully, while imported images are always available.
For PDF files the ImageTypeOptions can be used to specify which page in the PDF file to use for the image.
For raster based image files the page number must be 1 (the default).
ImageTypeOptions can be used to specify the resolution (in pixels per inch) to use for the image.
For PDF files the resolution is used to determine how many pixels to use
when rasterizing the PDF page.  Using a higher resolution will increase the number of pixels.
This will add more detail, but it will also make rendering the image slower.
In addition, it will likely increase the amount of data stored in the project when the image is imported.
Raster based images have a fixed number of pixels.
As a result, the resolution has no effect on the amount of detail or the amount of data that is stored.
The resolution is only used to determine the size of image.
Doubling the resolution will make the image appear half the size.
When a file is accessed with the help of an external server, it is likely that a local cache of the file will
be created temporarily. ImageTypeOptions may refer to the cached copy of the file internally. For this
reason, ImageTypeOptions should be treated as a transient object whose purpose is to become an argument to
ImageType.Create(Document, ImageTypeOptions)
or ImageType.ReloadFrom(ImageTypeOptions).
An application should not create an ImageTypeOptions object and hold onto it for a long time.
Since:
2020